[
  {
    "id": 1,
    "title": "Invoice app",
    "image": "./Projects/Invoice.png",
    "description": "A user-friendly invoice app built with Next.js, Tailwind CSS, and Mongoose, featuring Framer Motion for smooth animations. Users can manage invoices, perform CRUD operations, filter by status, toggle light/dark mode, and maintain state across sessions. Developed using TypeScript for reliability and scalability.",
    "githubLink": "https://github.com/DavitDvalashvili/invoice-app",
    "demoLink": "https://invoice-app-kohl-sigma.vercel.app/"
  },
  {
    "id": 2,
    "title": "Real estate web app",
    "image": "./Projects/Real-estate-app.png",
    "description": "A real estate app built with Node.js, Express, and Tailwind CSS. Users can securely sign up with email, log in with Google, manage profiles, and handle property listings. Features include property search, sorting, and image management. Uses Mongoose for data modeling, JWT and bcrypt for authentication, and Firebase for backend services.",
    "githubLink": "https://github.com/DavitDvalashvili/real-estate-web-app",
    "demoLink": "https://real-estate-web-app-client.vercel.app/"
  },
  {
    "id": 3,
    "title": "MERN countries with color theme switcher",
    "image": "./Projects/Countries.png",
    "description": "A TypeScript-based web app with Node.js, Express, MUI, and Redux Toolkit. Explore and search countries, filter by region, and view detailed information. Mongoose manages MongoDB object modeling. Navigate to bordering countries and toggle between light and dark modes for optimal viewing.",
    "githubLink": "https://github.com/DavitDvalashvili/rest-countries-api-with-color-theme-switcher",
    "demoLink": "https://rest-countries-api-front.vercel.app/"
  },
  {
    "id": 4,
    "title": "Entertainment web app",
    "image": "./Projects/Entertainment-app.png",
    "description": "A responsive entertainment app built with Node.js, Express, and Styled Components. Users can browse, bookmark, and search movies and TV shows, navigate between sections, and manage profiles. Full-stack features include JWT and bcrypt authentication. Developed with React Hook Form, Mongoose, and TypeScript for seamless and secure user experience.",
    "githubLink": "https://github.com/DavitDvalashvili/entertainment-web-app-front",
    "demoLink": "https://entertainment-web-app-front-beige.vercel.app/"
  },
  {
    "id": 5,
    "title": "MERN Todo app",
    "image": "./Projects/Todo.png",
    "description": "A feature-rich todo list app built with Node.js, Express, and MUI. Users can add, edit, mark as complete, and delete todos. Includes filters, sorting, and light/dark mode. Enhanced with Redux Toolkit for state management and Framer Motion for smooth animations. Mongoose manages data, and the app is developed with TypeScript for robust functionality",
    "githubLink": "https://github.com/DavitDvalashvili/todo-mern-app",
    "demoLink": "https://todo-mern-app-client.vercel.app/"
  },
  {
    "id": 6,
    "title": "Audiophile Ecommerce website",
    "image": "./Projects/Audiophile-eCommerce-website.png",
    "description": "An e-commerce app built with TypeScript, React, Styled-components, React Router, and React Helmet. Users can view responsive layouts, interact with hover states, manage their cart, fill in checkout fields with form validations, see accurate order totals, and receive an order confirmation modal with a summary after checkout.",
    "githubLink": "https://github.com/DavitDvalashvili/Audiophile-ecommerce-website",
    "demoLink": "https://audiophile-ecommerce-website-lake.vercel.app/"
  }
]
